
# Базовые данные для заказа
def base_order_payload(color=''):
    order_payload = {
    'firstName': 'Алексей',
    'lastName': 'Рогожников',
    'address': 'Пермь, Пермская, 5',
    'metroStation': 'Таганская',
    'phone': '+79994509000',
    'rentTime': 1,
    'deliveryDate': '2025-12-10',
    'comment': 'ЖДУ'
    }
    order_payload['color'] = color
    return order_payload

# Варианты цветов для параметризации
order_colors = [
    ['BLACK'],
    ['GREY'],
    ['BLACK', 'GREY'],
    []
]


# Варианты ответов ошибок в теле
Создание_курьера_с_повторяющимся_логином = 'Этот логин уже используется. Попробуйте другой.'
Создание_курьера_без_логина_или_пароля = 'Недостаточно данных для создания учетной записи'
Авторизация_курьера_без_логина_или_пароля = 'Недостаточно данных для входа'
Авторизация_курьера_с_несуществующим_логином_и_паролем = 'Учетная запись не найдена'